<?php
global $config;
$config = new Config();
class Config {public function __construct() {
  // Подключение к СУБД MySQL
  $this->dbHost = "";
  $this->dbName = "";
  $this->dbUser = "";
  $this->dbPassword = "";

  // Таблица городов, телефонов и доменных префиксов
  $this->cities = [
    1 => ['Москва', '88005555535', 'msk'],
    2 => ['Люберцы', '88005555535', 'lub'],
    3 => ['Раменское', '88005555535', 'ramenskoe'],
    4 => ['Жуковский', '88005555535', 'zhukovsky'],
    5 => ['Воскресенск', '88005555535', 'vsk'],
    6 => ['Бронницы', '88005555535', 'bronnitsy'],
    7 => ['Ступино', '88005555535', 'stupino'],
    8 => ['Коломна', '88005555535', 'kolomna'],

  ];

  // Таблица внутренних артикулов товаров
  $this->products = [
    // Если правильно тебя понял
    // Физ.лица
    1 => ['Поддерживающая уборка', 'b2c-pod'],
    2 => ['Генеральная уборка', 'b2c-gen'],
    3 => ['Уборка после ремонта', 'b2c-rem'],
    4 => ['Уборка запущенных квартир', 'b2c-dirt'],
    5 => ['Антибактериальная уборка', 'b2c-antib'],
    6 => ['Влажная уборка', 'b2c-wet'],
    7 => ['Эко уборка', 'b2c-eco'],
    8 => ['Уборка коттеджа', 'b2c-cot'],
    9 => ['Химчистка мягкой мебели', 'b2c-furnit'],
    10 => ['Химчистка ковролина', 'b2c-covr'],
    11 => ['Химчистка ковра', 'b2c-cov'],
    12 => ['Химчистка штор', 'b2c-shtor'],
    13 => ['Глажка белья', 'b2c-iron'],
    14 => ['Мытье окон', 'b2c-wind'],
      // Юр.лица тут калькулятора не будет(пока)
    100 => ['Генеральная уборка', 'b2b-gen'],
    101 => ['Уборка после ремонта', 'b2b-rem'],
    102 => ['Уборка после строительства', 'b2b-gen'],
    103 => ['Уборка  офисов', 'b2b-office'],
    104 => ['Уборка производственных помещений', 'b2b-proiz'],
    105 => ['Уборка торговых центров', 'b2b-tc'],
    106 => ['Уборка кафе и ресторанов', 'b2b-cafe'],
    107 => ['Уборка подъездов', 'b2b-pod'],
    108 => ['Уборка территорий', 'b2b-ter'],
    109 => ['Уборка школ', 'b2b-school'],
    110 => ['Уборка спортзала и фитнес клуба', 'b2b-sport'],
    111 => ['Уборка на мероприятии', 'b2b-mer'],
    112 => ['Уборка медицинских центров', 'b2b-med'],
    113 => ['Уборка автосервисов', 'b2b-autoser'],
    114 => ['Уборка парковок и паркингов', 'b2b-parkin'],
    115 => ['Уборка складов', 'b2b-sclad'],
    116 => ['Уборка салонов красоты', 'b2b-salon'],
    //----------------------------------------------------
    
  ];
}}
